haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
#include "image_installer.h"

#include <stdint.h>

#include "application_jump.h"
#include "backup_image.h"
#include "backup_image_storage.h"
#include "backup_progress.h"
#include "crc32.h"
#include "download_checkpoint_storage.h"
#include "external_flash_storage.h"
#include "full_image_validation.h"
#include "install_progress.h"
#include "memory_map.h"
#include "metadata_storage.h"
#include "spi_flash.h"
#include "stm32f10x.h"
#include "stm32f10x_flash.h"
#include "update_handoff.h"
#include "update_handoff_storage.h"

#define INSTALL_CRC_BUFFER_SIZE 256UL
#define PHASE8_ERROR_BASE       0x00080000UL

/*
 * A complete internal Flash page is staged in SRAM before the corresponding
 * application page is erased. The same buffer is also reused while backing up
 * the active image to W25Q.
 */
static uint8_t g_install_page_buffer[INTERNAL_FLASH_PAGE_SIZE];

static uint32_t InstallerError(ImageInstallerStatus_t status)
{
    return PHASE8_ERROR_BASE | (uint32_t)status;
}

static uint32_t GetPrimask(void)
{
    uint32_t primask;
    __asm volatile ("mrs %0, primask" : "=r" (primask));
    return primask;
}

static void RestorePrimask(uint32_t primask)
{
    __asm volatile ("msr primask, %0" : : "r" (primask) : "memory");
}

static uint32_t GetU32Le(const uint8_t *src)
{
    return (uint32_t)src[0] |
           ((uint32_t)src[1] << 8U) |
           ((uint32_t)src[2] << 16U) |
           ((uint32_t)src[3] << 24U);
}

static uint8_t RecordMatchesMetadata(const UpdateHandoffRecord_t *record,
                                     const BootMetadata_t *metadata)
{
    return (uint8_t)(
        (record->update_id == metadata->active_update_id) &&
        (record->target_version == metadata->pending_version) &&
        (record->image_size == metadata->expected_size) &&
        (metadata->received_size == metadata->expected_size));
}

static MetadataStorageStatus_t CommitMetadata(BootMetadata_t *metadata)
{
    BootMetadata_t committed;
    const MetadataStorageStatus_t status =
        MetadataStorage_Commit(metadata, &committed, (BootMetadataSlot_t *)0);

    if (status == METADATA_STORAGE_OK)
    {
        *metadata = committed;
    }

    return status;
}

static void CopyResult(const BootMetadata_t *metadata,
                       BootMetadata_t *result_metadata)
{
    if (result_metadata != (BootMetadata_t *)0)
    {
        *result_metadata = *metadata;
    }
}

static ImageInstallerStatus_t RevertToActiveImage(
    BootMetadata_t *metadata,
    ImageInstallerStatus_t reason,
    BootMetadata_t *result_metadata)
{
    metadata->state = (uint32_t)UPDATE_IDLE;
    metadata->pending_version = 0UL;
    metadata->active_update_id = 0UL;
    metadata->received_size = 0UL;
    metadata->expected_size = 0UL;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    metadata->last_error = InstallerError(reason);

    /*
     * The active internal image is still untouched in ARTIFACT_READY and
     * BACKING_UP. Discarding the persistent download checkpoint prevents the
     * application from resurrecting a rejected candidate on the next boot.
     */
    (void)DownloadCheckpointStorage_Clear();

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    CopyResult(metadata, result_metadata);
    return IMAGE_INSTALLER_SOURCE_REJECTED;
}

static void BestEffortMarkFailed(BootMetadata_t *metadata,
                                 ImageInstallerStatus_t reason)
{
    metadata->state = (uint32_t)UPDATE_FAILED;
    metadata->last_error = InstallerError(reason);
    (void)CommitMetadata(metadata);
}

static uint32_t CalculateInternalCrc(uint32_t length)
{
    uint8_t buffer[INSTALL_CRC_BUFFER_SIZE];
    uint32_t offset = 0UL;
    uint32_t running = CRC32_IEEE_INITIAL_VALUE;

    while (offset < length)
    {
        uint32_t chunk = length - offset;
        uint32_t i;
        volatile const uint8_t *source;

        if (chunk > sizeof(buffer))
        {
            chunk = sizeof(buffer);
        }

        source = (volatile const uint8_t *)(APPLICATION_START_ADDRESS + offset);
        for (i = 0UL; i < chunk; ++i)
        {
            buffer[i] = source[i];
        }

        running = Crc32_Update(running, buffer, chunk);
        offset += chunk;
    }

    return running ^ CRC32_IEEE_FINAL_XOR;
}

static ImageInstallerStatus_t CalculateExternalCrc(
    uint32_t length,
    uint32_t *crc_out)
{
    uint8_t buffer[INSTALL_CRC_BUFFER_SIZE];
    uint32_t offset = 0UL;
    uint32_t running = CRC32_IEEE_INITIAL_VALUE;

    if (crc_out == (uint32_t *)0)
    {
        return IMAGE_INSTALLER_SOURCE_READ_FAILED;
    }

    while (offset < length)
    {
        uint32_t chunk = length - offset;

        if (chunk > sizeof(buffer))
        {
            chunk = sizeof(buffer);
        }

        if (!ExternalFlashStorage_Read(EXTERNAL_FLASH_PARTITION_INCOMING,
                                       offset, buffer, chunk))
        {
            return IMAGE_INSTALLER_SOURCE_READ_FAILED;
        }

        running = Crc32_Update(running, buffer, chunk);
        offset += chunk;
    }

    *crc_out = running ^ CRC32_IEEE_FINAL_XOR;
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t CalculateBackupCrc(uint32_t *crc_out)
{
    uint8_t buffer[INSTALL_CRC_BUFFER_SIZE];
    uint32_t offset = 0UL;
    uint32_t running = CRC32_IEEE_INITIAL_VALUE;

    if (crc_out == (uint32_t *)0)
    {
        return IMAGE_INSTALLER_BACKUP_VERIFY_FAILED;
    }

    while (offset < APPLICATION_MAX_SIZE)
    {
        uint32_t chunk = APPLICATION_MAX_SIZE - offset;

        if (chunk > sizeof(buffer))
        {
            chunk = sizeof(buffer);
        }

        if (!BackupImageStorage_Read(offset, buffer, chunk))
        {
            return IMAGE_INSTALLER_BACKUP_VERIFY_FAILED;
        }

        running = Crc32_Update(running, buffer, chunk);
        offset += chunk;
    }

    *crc_out = running ^ CRC32_IEEE_FINAL_XOR;
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ValidateExternalSource(
    const UpdateHandoffRecord_t *record)
{
    uint8_t vector[8];
    uint32_t crc;
    ImageInstallerStatus_t crc_status;

    if (!ExternalFlashStorage_Read(EXTERNAL_FLASH_PARTITION_INCOMING,
                                   0UL, vector, sizeof(vector)))
    {
        return IMAGE_INSTALLER_SOURCE_READ_FAILED;
    }

    if (FullImage_ValidateVector(record->image_size,
                                 GetU32Le(&vector[0]),
                                 GetU32Le(&vector[4])) != FULL_IMAGE_VALID)
    {
        return IMAGE_INSTALLER_SOURCE_VECTOR_INVALID;
    }

    crc_status = CalculateExternalCrc(record->image_size, &crc);
    if (crc_status != IMAGE_INSTALLER_OK)
    {
        return crc_status;
    }

