haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }

    return ProgramBufferedApplicationPage(page_offset,
                                          page_length,
                                          metadata,
                                          0U);
}

static ImageInstallerStatus_t BeginBackup(BootMetadata_t *metadata)
{
    if (BackupImageStorage_InvalidateHeader() != BACKUP_IMAGE_STORAGE_OK)
    {
        return IMAGE_INSTALLER_BACKUP_HEADER_FAILED;
    }

    metadata->state = (uint32_t)UPDATE_BACKING_UP;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t CopyActiveImageToBackupChunk(
    uint32_t chunk_offset,
    uint32_t chunk_length)
{
    uint32_t copied = 0UL;

    if (!BackupImageStorage_EraseSector(chunk_offset))
    {
        return IMAGE_INSTALLER_BACKUP_ERASE_FAILED;
    }

    while (copied < chunk_length)
    {
        uint32_t length = chunk_length - copied;
        uint32_t i;
        volatile const uint8_t *source;

        if (length > sizeof(g_install_page_buffer))
        {
            length = sizeof(g_install_page_buffer);
        }

        source = (volatile const uint8_t *)(APPLICATION_START_ADDRESS +
                                            chunk_offset + copied);
        for (i = 0UL; i < length; ++i)
        {
            g_install_page_buffer[i] = source[i];
        }

        if (!BackupImageStorage_Write(chunk_offset + copied,
                                      g_install_page_buffer,
                                      length))
        {
            return IMAGE_INSTALLER_BACKUP_WRITE_FAILED;
        }

        if (!BackupImageStorage_Verify(chunk_offset + copied,
                                       g_install_page_buffer,
                                       length))
        {
            return IMAGE_INSTALLER_BACKUP_VERIFY_FAILED;
        }

        copied += length;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ResumeBackup(BootMetadata_t *metadata)
{
    ImageInstallerStatus_t status;
    uint32_t internal_crc;
    uint32_t backup_crc = 0UL;
    BackupImageRecord_t requested;
    BackupImageRecord_t committed;

    if (BackupProgress_Validate(metadata->copy_offset) !=
        BACKUP_PROGRESS_VALID)
    {
        return IMAGE_INSTALLER_BACKUP_PROGRESS_INVALID;
    }

    while (metadata->copy_offset < APPLICATION_MAX_SIZE)
    {
        const uint32_t chunk_offset = metadata->copy_offset;
        const uint32_t chunk_length =
            BackupProgress_ChunkLength(chunk_offset);
        const uint32_t next_offset =
            BackupProgress_NextCheckpoint(chunk_offset);

        status = CopyActiveImageToBackupChunk(chunk_offset, chunk_length);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }

        /*
         * A power cut during a 4 KiB W25Q sector copy leaves copy_offset at
         * the previous sector boundary. Recovery re-erases and rewrites that
         * entire sector.
         */
        metadata->copy_offset = next_offset;
        metadata->last_error = 0UL;

        if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
        {
            return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
        }
    }

    internal_crc = CalculateInternalCrc(APPLICATION_MAX_SIZE);
    status = CalculateBackupCrc(&backup_crc);
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }
    if (internal_crc != backup_crc)
    {
        return IMAGE_INSTALLER_BACKUP_CRC_MISMATCH;
    }

    BackupImage_Init(&requested, metadata->active_version, backup_crc);
    if (BackupImageStorage_CommitHeader(&requested, &committed) !=
        BACKUP_IMAGE_STORAGE_OK)
    {
        return IMAGE_INSTALLER_BACKUP_HEADER_FAILED;
    }

    metadata->state = (uint32_t)UPDATE_INSTALLING;
    metadata->copy_offset = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ResumePageCheckpointedCopy(
    const UpdateHandoffRecord_t *record,
    BootMetadata_t *metadata)
{
    ImageInstallerStatus_t status;

    if (InstallProgress_Validate(record->image_size,
                                 metadata->copy_offset) !=
        INSTALL_PROGRESS_VALID)
    {
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    while (metadata->copy_offset < record->image_size)
    {
        const uint32_t page_offset = metadata->copy_offset;
        const uint32_t next_offset =
            InstallProgress_NextCheckpoint(record->image_size, page_offset);

        status = ProgramAndVerifyIncomingPage(record,
                                              page_offset,
                                              metadata);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }

        metadata->copy_offset = next_offset;
        metadata->last_error = 0UL;

        if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
        {
            return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
        }
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t VerifyInstalledApplication(
    const UpdateHandoffRecord_t *record)
{
    volatile const uint32_t *vector =
        (volatile const uint32_t *)APPLICATION_START_ADDRESS;
    ApplicationVector_t application_vector;

    if (CalculateInternalCrc(record->image_size) != record->image_crc32)
    {
        return IMAGE_INSTALLER_VERIFY_CRC_FAILED;
    }

    if (FullImage_ValidateVector(record->image_size,
                                 vector[0], vector[1]) != FULL_IMAGE_VALID)
    {
        return IMAGE_INSTALLER_VERIFY_VECTOR_FAILED;
    }

    if (ApplicationJump_Validate(APPLICATION_START_ADDRESS,
                                 &application_vector) !=
        APPLICATION_VALIDATION_OK)
    {
        return IMAGE_INSTALLER_VERIFY_VECTOR_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t TransitionToVerify(
    BootMetadata_t *metadata,
    uint32_t image_size)
{
    metadata->state = (uint32_t)UPDATE_VERIFYING_INSTALL;
    metadata->copy_offset = image_size;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t BeginInstall(BootMetadata_t *metadata)
{
    metadata->state = (uint32_t)UPDATE_INSTALLING;
    metadata->copy_offset = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t TransitionToTrialBoot(
    BootMetadata_t *metadata,
    BootMetadata_t *result_metadata)
{
    /*
     * The incoming candidate is no longer required for recovery after internal
     * verify: rollback uses the separate validated backup. Clear the Phase-7
     * download checkpoint before publishing TRIAL_BOOT. A reset before the
     * metadata commit simply re-enters VERIFYING_INSTALL and retries.
     */
    if (DownloadCheckpointStorage_Clear() !=
        DOWNLOAD_CHECKPOINT_STORAGE_OK)
    {
        return IMAGE_INSTALLER_CHECKPOINT_CLEAR_FAILED;
    }

    metadata->state = (uint32_t)UPDATE_TRIAL_BOOT;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    metadata->last_error = 0UL;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_TRIAL_TRANSITION_FAILED;
    }

    CopyResult(metadata, result_metadata);
    return IMAGE_INSTALLER_OK;
}

static uint32_t RollbackDiagnostic(const BootMetadata_t *metadata)
{
    if (metadata->state == (uint32_t)UPDATE_ROLLBACK)
    {
        return metadata->last_error;
    }

    if (metadata->boot_attempts >= BOOT_METADATA_MAX_BOOT_ATTEMPTS)
    {
        return IMAGE_INSTALLER_PHASE8_ROLLBACK_TRIAL_LIMIT_BASE |
               (metadata->boot_attempts & 0xFFUL);
    }

    if (metadata->state == (uint32_t)UPDATE_TRIAL_BOOT)
    {
        return IMAGE_INSTALLER_PHASE8_ROLLBACK_INVALID_TRIAL;
    }

    return IMAGE_INSTALLER_PHASE8_ROLLBACK_INSTALL_BASE;
}

