haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
static ImageInstallerStatus_t BeginRollback(
    BootMetadata_t *metadata,
    uint32_t diagnostic)
{
    metadata->state = (uint32_t)UPDATE_ROLLBACK;
    metadata->copy_offset = 0UL;
    metadata->last_error = diagnostic;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }
    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t ResumeRollbackCopy(BootMetadata_t *metadata)
{
    ImageInstallerStatus_t status;

    if (InstallProgress_Validate(APPLICATION_MAX_SIZE,
                                 metadata->copy_offset) !=
        INSTALL_PROGRESS_VALID)
    {
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    while (metadata->copy_offset < APPLICATION_MAX_SIZE)
    {
        const uint32_t page_offset = metadata->copy_offset;
        const uint32_t next_offset =
            InstallProgress_NextCheckpoint(APPLICATION_MAX_SIZE,
                                           page_offset);

        status = ProgramAndVerifyBackupPage(page_offset, metadata);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }

        metadata->copy_offset = next_offset;
        /* Preserve rollback diagnostic in last_error across every checkpoint. */

        if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
        {
            return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
        }
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t VerifyRolledBackApplication(
    const BackupImageRecord_t *backup)
{
    volatile const uint32_t *vector =
        (volatile const uint32_t *)APPLICATION_START_ADDRESS;
    ApplicationVector_t application_vector;

    if (CalculateInternalCrc(APPLICATION_MAX_SIZE) != backup->image_crc32)
    {
        return IMAGE_INSTALLER_ROLLBACK_VERIFY_FAILED;
    }

    if (FullImage_ValidateVector(APPLICATION_MAX_SIZE,
                                 vector[0], vector[1]) != FULL_IMAGE_VALID)
    {
        return IMAGE_INSTALLER_ROLLBACK_VERIFY_FAILED;
    }

    if (ApplicationJump_Validate(APPLICATION_START_ADDRESS,
                                 &application_vector) !=
        APPLICATION_VALIDATION_OK)
    {
        return IMAGE_INSTALLER_ROLLBACK_VERIFY_FAILED;
    }

    return IMAGE_INSTALLER_OK;
}

static ImageInstallerStatus_t FinalizeRollback(
    BootMetadata_t *metadata,
    const BackupImageRecord_t *backup,
    uint32_t diagnostic,
    BootMetadata_t *result_metadata)
{
    (void)DownloadCheckpointStorage_Clear();

    metadata->state = (uint32_t)UPDATE_IDLE;
    metadata->active_version = backup->active_version;
    metadata->pending_version = 0UL;
    metadata->active_update_id = 0UL;
    metadata->received_size = 0UL;
    metadata->expected_size = 0UL;
    metadata->copy_offset = 0UL;
    metadata->boot_attempts = 0UL;
    /*
     * Unlike a successful confirmation, rollback retains a compact diagnostic
     * so hardware tests and field logs can prove why the previous candidate
     * was rejected. IDLE permits a non-zero last_error.
     */
    metadata->last_error = diagnostic;

    if (CommitMetadata(metadata) != METADATA_STORAGE_OK)
    {
        return IMAGE_INSTALLER_FINALIZE_FAILED;
    }

    CopyResult(metadata, result_metadata);
    return IMAGE_INSTALLER_OK;
}

ImageInstallerStatus_t ImageInstaller_ProcessRollback(
    const BootMetadata_t *metadata,
    BootMetadata_t *result_metadata)
{
    BootMetadata_t working;
    BackupImageRecord_t backup;
    ImageInstallerStatus_t status;
    uint32_t diagnostic;

    if (metadata == (const BootMetadata_t *)0)
    {
        return IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID;
    }

    working = *metadata;

    if (!ExternalFlashStorage_Init())
    {
        return IMAGE_INSTALLER_EXTERNAL_FLASH_INIT_FAILED;
    }

    status = ValidateBackupImage(&backup);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID);
        return IMAGE_INSTALLER_ROLLBACK_SOURCE_INVALID;
    }

    diagnostic = RollbackDiagnostic(&working);

    if (working.state != (uint32_t)UPDATE_ROLLBACK)
    {
        status = BeginRollback(&working, diagnostic);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }
    }
    else if (InstallProgress_Validate(APPLICATION_MAX_SIZE,
                                      working.copy_offset) !=
             INSTALL_PROGRESS_VALID)
    {
        BestEffortMarkFailed(&working, IMAGE_INSTALLER_PROGRESS_INVALID);
        return IMAGE_INSTALLER_PROGRESS_INVALID;
    }

    status = ResumeRollbackCopy(&working);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, status);
        return status;
    }

    status = VerifyRolledBackApplication(&backup);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, status);
        return status;
    }

    return FinalizeRollback(&working, &backup, diagnostic, result_metadata);
}

static ImageInstallerStatus_t RollbackAfterInstallFailure(
    BootMetadata_t *metadata,
    ImageInstallerStatus_t reason,
    BootMetadata_t *result_metadata)
{
    metadata->last_error =
        IMAGE_INSTALLER_PHASE8_ROLLBACK_INSTALL_BASE |
        ((uint32_t)reason & 0xFFUL);

    if (BeginRollback(metadata, metadata->last_error) != IMAGE_INSTALLER_OK)
    {
        return IMAGE_INSTALLER_METADATA_COMMIT_FAILED;
    }

    return ImageInstaller_ProcessRollback(metadata, result_metadata);
}

ImageInstallerStatus_t ImageInstaller_ProcessBasicFull(
    const BootMetadata_t *metadata,
    BootMetadata_t *result_metadata)
{
    BootMetadata_t working;
    UpdateHandoffRecord_t record;
    UpdateHandoffStorageStatus_t handoff_status;
    BackupImageRecord_t backup;
    ImageInstallerStatus_t status;
    const uint8_t internal_may_be_modified =
        (uint8_t)((metadata != (const BootMetadata_t *)0) &&
                  ((metadata->state == (uint32_t)UPDATE_INSTALLING) ||
                   (metadata->state == (uint32_t)UPDATE_VERIFYING_INSTALL)));

    if (metadata == (const BootMetadata_t *)0)
    {
        return IMAGE_INSTALLER_HANDOFF_MISMATCH;
    }

    working = *metadata;

    if (!ExternalFlashStorage_Init())
    {
        return IMAGE_INSTALLER_EXTERNAL_FLASH_INIT_FAILED;
    }

