haikevins/secure-delta-ota-bootloader/node-stm32f103/bootloader/src/image_installer.c
    handoff_status = UpdateHandoffStorage_Load(&record,
                                               (UpdateHandoffSlot_t *)0);
    if (handoff_status != UPDATE_HANDOFF_STORAGE_OK)
    {
        if (internal_may_be_modified == 0U)
        {
            return RevertToActiveImage(&working,
                                       IMAGE_INSTALLER_HANDOFF_LOAD_FAILED,
                                       result_metadata);
        }

        return RollbackAfterInstallFailure(
            &working,
            IMAGE_INSTALLER_HANDOFF_LOAD_FAILED,
            result_metadata);
    }

    if (RecordMatchesMetadata(&record, &working) == 0U)
    {
        if (internal_may_be_modified == 0U)
        {
            return RevertToActiveImage(&working,
                                       IMAGE_INSTALLER_HANDOFF_MISMATCH,
                                       result_metadata);
        }

        return RollbackAfterInstallFailure(
            &working,
            IMAGE_INSTALLER_HANDOFF_MISMATCH,
            result_metadata);
    }

    /*
     * Candidate source is revalidated on every recovery boot. During backup
     * the old active application is still intact, so a bad source can simply
     * be rejected. Once INSTALLING begins, a bad source triggers restoration
     * from the already validated backup instead.
     */
    status = ValidateExternalSource(&record);
    if (status != IMAGE_INSTALLER_OK)
    {
        if (internal_may_be_modified == 0U)
        {
            return RevertToActiveImage(&working, status, result_metadata);
        }

        return RollbackAfterInstallFailure(&working, status, result_metadata);
    }

    if (working.state == (uint32_t)UPDATE_ARTIFACT_READY)
    {
        status = BeginBackup(&working);
        if (status != IMAGE_INSTALLER_OK)
        {
            BestEffortMarkFailed(&working, status);
            return status;
        }
    }

    if (working.state == (uint32_t)UPDATE_BACKING_UP)
    {
        status = ResumeBackup(&working);
        if (status != IMAGE_INSTALLER_OK)
        {
            /*
             * Internal app remains untouched until backup has completely
             * verified and the metadata state reaches INSTALLING.
             */
            return RevertToActiveImage(&working, status, result_metadata);
        }
    }

    /*
     * From this point onward backup must remain valid throughout install and
     * trial. Detect backup corruption before touching/re-touching internal app.
     */
    status = ValidateBackupImage(&backup);
    if (status != IMAGE_INSTALLER_OK)
    {
        BestEffortMarkFailed(&working, status);
        return status;
    }

    if (working.state == (uint32_t)UPDATE_VERIFYING_INSTALL)
    {
        status = VerifyInstalledApplication(&record);
        if (status == IMAGE_INSTALLER_OK)
        {
            return TransitionToTrialBoot(&working, result_metadata);
        }

        /*
         * Candidate source is still valid (checked above), so retry install
         * from page zero. The active backup remains untouched.
         */
        status = BeginInstall(&working);
        if (status != IMAGE_INSTALLER_OK)
        {
            return status;
        }
    }
    else if (working.state == (uint32_t)UPDATE_INSTALLING)
    {
        if (InstallProgress_Validate(record.image_size,
                                     working.copy_offset) !=
            INSTALL_PROGRESS_VALID)
        {
            return RollbackAfterInstallFailure(
                &working,
                IMAGE_INSTALLER_PROGRESS_INVALID,
                result_metadata);
        }
    }
    else
    {
        return RollbackAfterInstallFailure(
            &working,
            IMAGE_INSTALLER_HANDOFF_MISMATCH,
            result_metadata);
    }

    status = ResumePageCheckpointedCopy(&record, &working);
    if (status != IMAGE_INSTALLER_OK)
    {
        if (status == IMAGE_INSTALLER_METADATA_COMMIT_FAILED)
        {
            return status;
        }

        return RollbackAfterInstallFailure(&working, status, result_metadata);
    }

    status = TransitionToVerify(&working, record.image_size);
    if (status != IMAGE_INSTALLER_OK)
    {
        return status;
    }

    status = VerifyInstalledApplication(&record);
    if (status != IMAGE_INSTALLER_OK)
    {
        return RollbackAfterInstallFailure(&working, status, result_metadata);
    }

    return TransitionToTrialBoot(&working, result_metadata);
}
